Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::PipeSegmentPreferenceTable Class Referencefinal
MEP Element Manager
The PipeSegmentPreferenceTable contains cross section related information for Pipe routing segments. More...
#include <MEPPipeSegmentPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::v1::PipeSegmentPreferenceTable:
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< uint32_t >  | GetReferenceId (uint32_t index) const
Result< bool >  | IsRowValid (uint32_t index) const
A row is considered valid if its diameter and wall thickness contains non-zero values, description is optional.
Result< bool >  | IsRowValidByReferenceId (uint32_t referenceId) const
A row is considered valid if its diameter and wall thickness contains non-zero values, description is optional.
Result< double >  | GetDiameter (uint32_t index) const
Result< double >  | GetDiameterByReferenceId (uint32_t referenceId) const
Result< double >  | GetWallThickness (uint32_t index) const
Result< double >  | GetWallThicknessByReferenceId (uint32_t referenceId) const
Result< GS::UniString >  | GetDescription (uint32_t index) const
Result< GS::UniString >  | GetDescriptionByReferenceId (uint32_t referenceId) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< void >  | EmptyRow (uint32_t index)
Empties a row from the table.
Result< void >  | EmptyRowByReferenceId (uint32_t referenceId)
Empties a row from the table.
Result< void >  | SetDiameter (uint32_t index, double value)
Sets the diameter value of a table's row.
Result< void >  | SetDiameterByReferenceId (uint32_t referenceId, double value)
Sets the diameter value of a table's row.
Result< void >  | SetWallThickness (uint32_t index, double value)
Sets the wall thickness value of a table's row.
Result< void >  | SetWallThicknessByReferenceId (uint32_t referenceId, double value)
Sets the wall thickness value of a table's row.
Result< void >  | SetDescription (uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
Result< void >  | SetDescriptionByReferenceId (uint32_t referenceId, const GS::UniString &description)
Sets the description of a table's row.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< PipeSegmentPreferenceTable >  | Get (const UniqueID &uniqueId)
Returns a PipeSegmentPreferenceTable.
 Protected Member Functions
Modifier (PipeSegmentPreferenceTable &parent)
Constructs a Modifier with the given PipeSegmentPreferenceTable.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The PipeSegmentPreferenceTable contains cross section related information for Pipe routing segments.
Since
Archicad 28
The table uses the keys defined by the PipeReferenceSet. To consider a table row usable and valid, it should have all its fields filled, beside its description, which is optional.
Example code snippet from Test / New MEP
Take a look at PreferenceTableContainerBase
Member Function Documentation
◆ EmptyRow()
 Result< void > ACAPI::MEP::v1::PipeSegmentPreferenceTable::EmptyRow  |  ( |  uint32_t  |  index | )
Empties a row from the table.
Parameters
index | The index of the row. Index starts from 0.
The row itself will not be deleted, only becomes invalid. Invalid rows cannot be used for Pipe route placement / modification.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ EmptyRowByReferenceId()
 Result< void > ACAPI::MEP::v1::PipeSegmentPreferenceTable::EmptyRowByReferenceId  |  ( |  uint32_t  |  referenceId | )
Empties a row from the table.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
The row itself will not be deleted, only becomes invalid. Invalid rows cannot be used for Pipe route placement / modification.
Returns
Returns error if the referenceId is not in the table, otherwise nothing.
◆ Exists()
 bool ACAPI::MEP::v1::PipeSegmentPreferenceTable::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< PipeSegmentPreferenceTable > ACAPI::MEP::v1::PipeSegmentPreferenceTable::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a PipeSegmentPreferenceTable.
Parameters
uniqueId | The UniqueID of the requested PipeSegmentPreferenceTable.
Returns
If the uniqueId belongs to a PipeSegmentPreferenceTable, returns the object associated to it, otherwise Error.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::v1::PipeSegmentPreferenceTable::GetDescription  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the description of the table's row.
◆ GetDescriptionByReferenceId()
 Result< GS::UniString > ACAPI::MEP::v1::PipeSegmentPreferenceTable::GetDescriptionByReferenceId  |  ( |  uint32_t  |  referenceId | ) |   const
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the referenceId is not in the table, otherwise returns the description of the table's row.
◆ GetDiameter()
 Result< double > ACAPI::MEP::v1::PipeSegmentPreferenceTable::GetDiameter  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetDiameterByReferenceId()
 Result< double > ACAPI::MEP::v1::PipeSegmentPreferenceTable::GetDiameterByReferenceId  |  ( |  uint32_t  |  referenceId | ) |   const
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the referenceId is not in the table, otherwise returns the diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetName()
 GS::UniString ACAPI::MEP::v1::PipeSegmentPreferenceTable::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetReferenceId()
 Result< uint32_t > ACAPI::MEP::v1::PipeSegmentPreferenceTable::GetReferenceId  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the referenceId of the table's row.
◆ GetSize()
 uint32_t ACAPI::MEP::v1::PipeSegmentPreferenceTable::GetSize  |  ( |   | ) |   const
Returns
Returns the size of the table.
◆ GetWallThickness()
 Result< double > ACAPI::MEP::v1::PipeSegmentPreferenceTable::GetWallThickness  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the wall thickness value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetWallThicknessByReferenceId()
 Result< double > ACAPI::MEP::v1::PipeSegmentPreferenceTable::GetWallThicknessByReferenceId  |  ( |  uint32_t  |  referenceId | ) |   const
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the referenceId is not in the table, otherwise returns the wall thickness value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ IsEditable()
 Result< void > ACAPI::MEP::v1::PipeSegmentPreferenceTable::IsEditable  |  ( |   | ) |   const
Checks whether the table is editable.
Returns
Returns nothing if the table is editable, otherwise the error code and error message containing information about the reason.
◆ IsRowValid()
 Result< bool > ACAPI::MEP::v1::PipeSegmentPreferenceTable::IsRowValid  |  ( |  uint32_t  |  index | ) |   const
A row is considered valid if its diameter and wall thickness contains non-zero values, description is optional.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the validity state of the row.
◆ IsRowValidByReferenceId()
 Result< bool > ACAPI::MEP::v1::PipeSegmentPreferenceTable::IsRowValidByReferenceId  |  ( |  uint32_t  |  referenceId | ) |   const
A row is considered valid if its diameter and wall thickness contains non-zero values, description is optional.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the referenceId is not in the PipeReferenceSet, otherwise returns the validity state of the row.
◆ Modifier()
 ACAPI::MEP::v1::PipeSegmentPreferenceTable::Modifier  |  ( |  PipeSegmentPreferenceTable &  |  parent | )
protected
Constructs a Modifier with the given PipeSegmentPreferenceTable.
Parameters
parent | The given PipeSegmentPreferenceTable.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::PipeSegmentPreferenceTable::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetDescription()
 Result< void > ACAPI::MEP::v1::PipeSegmentPreferenceTable::SetDescription  |  ( |  uint32_t  |  index,
|  const GS::UniString &  |  description
)
Sets the description of a table's row.
Parameters
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDescriptionByReferenceId()
 Result< void > ACAPI::MEP::v1::PipeSegmentPreferenceTable::SetDescriptionByReferenceId  |  ( |  uint32_t  |  referenceId,
|  const GS::UniString &  |  description
)
Sets the description of a table's row.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
description | The description to be set.
If there isn't any row with the given referenceId, but the referenceId is defined in the DuctReferenceSet, it will insert the row.
Returns
Returns error if the referenceId is not in the PipeReferenceSet, otherwise nothing.
◆ SetDiameter()
 Result< void > ACAPI::MEP::v1::PipeSegmentPreferenceTable::SetDiameter  |  ( |  uint32_t  |  index,
|  double  |  value
)
Sets the diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
value | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDiameterByReferenceId()
 Result< void > ACAPI::MEP::v1::PipeSegmentPreferenceTable::SetDiameterByReferenceId  |  ( |  uint32_t  |  referenceId,
|  double  |  value
)
Sets the diameter value of a table's row.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
value | The value to be set. Must be a non-zero positive number.
If there isn't any row with the given referenceId, but the referenceId is defined in the DuctReferenceSet, it will insert the row.
Returns
Returns error if the referenceId is not in the PipeReferenceSet, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::v1::PipeSegmentPreferenceTable::SetName  |  ( |  const GS::UniString &  |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.
◆ SetWallThickness()
 Result< void > ACAPI::MEP::v1::PipeSegmentPreferenceTable::SetWallThickness  |  ( |  uint32_t  |  index,
|  double  |  value
)
Sets the wall thickness value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
value | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetWallThicknessByReferenceId()
 Result< void > ACAPI::MEP::v1::PipeSegmentPreferenceTable::SetWallThicknessByReferenceId  |  ( |  uint32_t  |  referenceId,
|  double  |  value
)
Sets the wall thickness value of a table's row.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
value | The value to be set. Must be a non-zero positive number.
If there isn't any row with the given referenceId, but the referenceId is defined in the DuctReferenceSet, it will insert the row.
Returns
Returns error if the referenceId is not in the PipeReferenceSet, otherwise nothing.